
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1-从001到OOP · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../2-登上爪哇岛/登上爪哇岛.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.1.1" data-path="从001到OOP.html">
            
                <a href="从001到OOP.html">
            
                    
                    1-从001到OOP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../2-登上爪哇岛/登上爪哇岛.html">
            
                <a href="../2-登上爪哇岛/登上爪哇岛.html">
            
                    
                    2-登上爪哇岛
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="../3-神奇的补码/神奇的补码.html">
            
                <a href="../3-神奇的补码/神奇的补码.html">
            
                    
                    3-神奇的补码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="../4-浅谈基本数据类型/浅谈基本数据类型.html">
            
                <a href="../4-浅谈基本数据类型/浅谈基本数据类型.html">
            
                    
                    4-浅谈基本数据类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="../5-标识符和运算符/标识符和运算符.html">
            
                <a href="../5-标识符和运算符/标识符和运算符.html">
            
                    
                    5-标识符和运算符
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.6" data-path="../6-流程控制语句/流程控制语句.html">
            
                <a href="../6-流程控制语句/流程控制语句.html">
            
                    
                    6-流程控制语句
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.7" data-path="../7-深入循环结构/深入循环结构.html">
            
                <a href="../7-深入循环结构/深入循环结构.html">
            
                    
                    7-深入循环结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.8" data-path="../8-数组与排序/数组与排序.html">
            
                <a href="../8-数组与排序/数组与排序.html">
            
                    
                    8-数组与排序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.9" data-path="../9-功能体现之方法/功能体现之方法.html">
            
                <a href="../9-功能体现之方法/功能体现之方法.html">
            
                    
                    9-功能体现之方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.10" data-path="../10-面向对象编程/面向对象编程.html">
            
                <a href="../10-面向对象编程/面向对象编程.html">
            
                    
                    10-面向对象编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.11" data-path="../11-内部类/内部类.html">
            
                <a href="../11-内部类/内部类.html">
            
                    
                    11-内部类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.12" data-path="../12-处理异常/处理异常.html">
            
                <a href="../12-处理异常/处理异常.html">
            
                    
                    12-处理异常
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.13" data-path="../13-常用类之Object/常用类之Object.html">
            
                <a href="../13-常用类之Object/常用类之Object.html">
            
                    
                    13-常用类之Object
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.14" data-path="../14-常用类之Arrays/常用类之Arrays.html">
            
                <a href="../14-常用类之Arrays/常用类之Arrays.html">
            
                    
                    14-常用类之Arrays
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.15" data-path="../15-常用类之String/常用类之String.html">
            
                <a href="../15-常用类之String/常用类之String.html">
            
                    
                    15-常用类之String
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1-从001到OOP</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4ECE;001&#x5230;oop">&#x4ECE;001&#x5230;OOP</h1>
<p>&#x4E16;&#x754C;&#x4E0A;&#x7B2C;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x5728;1946&#x5E74;&#x7684;&#x60C5;&#x4EBA;&#x8282;&#x8BDE;&#x751F;&#x7684;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x5374;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x5F62;&#x6210;&#x7684;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x600E;&#x4E48;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x5C31;&#x662F;&#x51E0;&#x6839;&#x7EBF;&#x51E0;&#x4E2A;&#x903B;&#x8F91;&#x5F00;&#x5173;&#x7EC4;&#x6210;&#x7684;&#x7535;&#x8DEF;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x7EBF;&#x7684;&#x901A;&#x548C;&#x65AD;&#x8FD9;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x7279;&#x6027;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF08;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x5355;&#x662F;&#x5B66;&#x4E60;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x6DF1;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x4E86;&#x89E3;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x673A;&#x5668;&#x8BED;&#x8A00;">&#x4E00;&#x3001;&#x673A;&#x5668;&#x8BED;&#x8A00;</h2>
<p>&#x673A;&#x5668;&#x8BED;&#x8A00;&#x5C31;&#x662F;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x6709; 0 &#x548C; 1&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x61C2;&#x7F16;&#x7A0B;&#xFF0C;&#x8FD8;&#x8981;&#x77E5;&#x9053;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x90E8;&#x6784;&#x9020;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x662F;&#x76F4;&#x63A5;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#x7684;&#x3002;&#x600E;&#x4E48;&#x5C06; 0 &#x548C; 1 &#x7684;&#x4FE1;&#x606F;&#x4F20;&#x5165;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#x5462;&#xFF1F;&#x76F8;&#x4F20;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x7EB8;&#x5E26;&#x4E0A;&#x9762;&#x6253;&#x6D1E;&#x6D1E;&#x7F16;&#x7A0B;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x3002;</p>
<p><img src="0003.jpg" alt="img01"></p>
<p>&#x8FD9;&#x79CD;&#x5DE5;&#x5177;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x597D;&#x73A9;&#xFF0C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x8FD9;&#x4E00;&#x4EF6;&#x591A;&#x4E48;&#x590D;&#x6742;&#x53C8;&#x65E0;&#x8DA3;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x6253;&#x9519;&#x4E86;&#x600E;&#x4E48;&#x529E;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x7406;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5149;&#x4FE1;&#x53F7;&#x5C06;&#x7EB8;&#x5E26;&#x4E0A;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x8BFB;&#x5165;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x3002;</p>
<p><img src="0002.jpg" alt="img02"></p>
<p>&#x662F;&#x4E0D;&#x662F;&#x611F;&#x89C9;&#x5F88;&#x795E;&#x5947;&#xFF0C;&#x8FD8;&#x6709;&#x8BF4;&#x6CD5;&#x5C31;&#x662F;&#x725B;&#x903C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7F16;&#x7A0B;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x4E0D;&#x53D1;&#x5C55;&#xFF0C;&#x8FD8;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x6562;&#x80AF;&#x5B9A;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x6B7B;&#x7684;&#x66F4;&#x591A;&#x7684;&#x3002;</p>
<p><img src="0001.jpg" alt="img03"></p>
<h2 id="&#x4E8C;&#x3001;&#x6C47;&#x7F16;&#x8BED;&#x8A00;">&#x4E8C;&#x3001;&#x6C47;&#x7F16;&#x8BED;&#x8A00;</h2>
<p>&#x8FD9;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x7528;&#x6765;&#x7F16;&#x7A0B;&#x592A;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x5199;&#x4E2A;250250&#x5C31;&#x8981;&#x7528; 111101000110001010 &#x8FD9;&#x4E48;&#x957F;&#x7684;&#x6570;&#x6765;&#x5B58;&#x50A8;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x8FD8;&#x53EA;&#x662F;&#x4E24;&#x4E2A; 250&#xFF0C;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x53EF;&#x4E0D;&#x6562;&#x4FDD;&#x8BC1;&#x4E0B;&#x6B21;&#x770B;&#x5230;&#x5B83;&#xFF0C;&#x8FD8;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x662F;&#x4E2A; 250&#x3002;&#x4EBA;&#x7C7B;&#x662F;&#x806A;&#x660E;&#x7684;&#xFF0C;&#x800C;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x6700;&#x806A;&#x660E;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x7528;&#x4E00;&#x4E9B;&#x7528;&#x4E00;&#x4E9B;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x6765;&#x4EE3;&#x66FF;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x64CD;&#x4F5C;&#x7801;&#x3002;
&#x6211;&#x60F3;&#x8981;&#x7ED9;&#x4E00;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x8D4B;&#x503C;&#xFF0C;&#x4EE5;&#x524D;&#x8D4B;&#x503C;&#x7684;&#x64CD;&#x4F5C;&#x8981;&#x7528;&#x4E00;&#x4E32;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5730;&#x5740;&#x4E5F;&#x8981;&#x4E00;&#x4E32;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x8FD9;&#x8D4B;&#x503C;&#x7684;&#x64CD;&#x4F5C;&#x7801;&#x7528;&#x4E00;&#x4E2A;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x6765;&#x4EE3;&#x66FF;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x4E5F;&#x7528;&#x4E00;&#x4E2A;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x6765;&#x4EE3;&#x66FF;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x7528;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x628A;&#x5B83;&#x4EEC;&#x7FFB;&#x8BD1;&#x6210;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#x9001;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x5C31;&#x884C;&#x4E86;&#x5417;&#xFF1F;&#x771F;&#x662F;&#x673A;&#x667A;&#x5982;&#x6211;&#x3002;
&#x628A;&#x8D4B;&#x503C;&#x7684;&#x64CD;&#x4F5C;&#x5C31;&#x53D6;&#x6210; Move &#x5427;&#xFF01;&#x8FD9;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x53EB; AX &#x5427;&#xFF01;&#x7B80;&#x5355;&#x70B9;&#xFF0C;&#x8BF4;&#x8BDD;&#x7684;&#x65B9;&#x5F0F;&#x7B80;&#x5355;&#x70B9;&#xFF0C;&#x628A;Move &#x7F29;&#x5199;&#x6210; mov &#x5427;&#xFF01;&#x4E8E;&#x662F;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x5C31;&#x6210;&#x8FD9;&#x6837;&#x4E86;&#xFF0C;&#x5047;&#x8BBE;&#x8D4B;&#x7684;&#x503C;&#x662F; 250&#x3002;</p>
<pre><code>mov ax,250
</code></pre><p>&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4E2A;&#x4E1C;&#x897F;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;pop&#xFF08;procedure-oriented-programming&#xFF09;">&#x4E09;&#x3001;POP&#xFF08;Procedure Oriented Programming&#xFF09;</h2>
<p>&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x5C31;&#x591F;&#x4E86;&#x5417;&#xFF1F;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#x4E86;&#xFF0C;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x6210;&#x500D;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x5C0F;&#x6253;&#x5C0F;&#x95F9;&#x8FD8;&#x884C;&#xFF0C;&#x5904;&#x7406;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x4E0D;&#x7ED9;&#x529B;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x65F6;&#x5019;&#x4E0D;&#x662F;&#x4E0D;&#x7ED9;&#x529B;&#xFF0C;&#x800C;&#x662F;&#x51FA;&#x73B0;&#x4E86;&#x548C;&#x673A;&#x5668;&#x7801;&#x540C;&#x6837;&#x7684;&#x547D;&#x8FD0;&#xFF0C;&#x5C31;&#x662F;&#x5904;&#x7406;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x8BFB;&#x6027;&#x592A;&#x5DEE;&#x3002;&#x4ECE;&#x673A;&#x5668;&#x7801;&#x5230;&#x6C47;&#x7F16;&#xFF0C;&#x662F;&#x7528;&#x4E00;&#x4E9B;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x4EE3;&#x66FF;&#x6C47;&#x7F16;&#x5E38;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x4E8E;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x60F3;&#xFF0C;&#x600E;&#x4E48;&#x63D0;&#x9AD8;&#x6C47;&#x7F16;&#x5904;&#x7406;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x5462;&#xFF1F;&#x4E8E;&#x662F;&#x5C31;&#x628A;&#x6C47;&#x7F16;&#x5904;&#x7406;&#x95EE;&#x9898;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x5957;&#x8DEF;&#x518D;&#x7528;&#x4E00;&#x4E9B;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x6765;&#x4EE3;&#x66FF;&#xFF0C;&#x8FD9;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x719F;&#x6089;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86; C &#x8BED;&#x8A00;&#x8FD9;&#x6837;&#x7684;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x3002;
C &#x8BED;&#x8A00;&#x662F;&#x7531;&#x6C47;&#x7F16;&#x800C;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x7387;&#x5730;&#x5F00;&#x53D1;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x3002;&#x5B83;&#x662F;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#xFF08;Procedure Oriented Programming&#xFF09;&#x7684;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x5C31;&#x662F;&#x505A;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x5728;&#x4E4E;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x548C;&#x7ED3;&#x679C;&#x3002;&#x7528;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x6765;&#x5904;&#x7406;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x751F;&#x4EA7;&#x9700;&#x8981;&#xFF0C;&#x5904;&#x7406;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x4E5F;&#x4E0D;&#x591F;&#x63A5;&#x8FD1;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5199;&#x7A0B;&#x5E8F;&#x5B9E;&#x73B0;&#x6253;&#x4EBA;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7528;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">()</span></span>{
    beat(&#x6253;&#x7684;&#x4EBA;,&#x88AB;&#x6253;&#x7684;&#x4EBA;);        <span class="hljs-comment">//&#x5B9E;&#x73B0;&#x4E86;&#x6253;&#x4EBA;&#x7684;&#x65B9;&#x6CD5;</span>
}
</code></pre>
<h2 id="&#x56DB;&#x3001;oop&#xFF08;object-oriented-programming&#xFF09;">&#x56DB;&#x3001;OOP&#xFF08;Object Oriented Programming&#xFF09;</h2>
<p>&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x6B64;&#x65F6;&#x5DF2;&#x7ECF;&#x8D8B;&#x4E8E;&#x6210;&#x719F;&#x4E86;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x66F4;&#x63A5;&#x8FD1;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF08;Object Oriented Programming&#xFF09;&#x7684;&#x8BED;&#x8A00;&#x5C31;&#x88AB;&#x53D1;&#x660E;&#x51FA;&#x6765;&#x4E86;&#x3002;OOP&#x5904;&#x7406;&#x95EE;&#x9898;&#x65F6;&#x4E3B;&#x8981;&#x8BA9;&#x4EBA;&#x6CE8;&#x91CD;&#x65B9;&#x6CD5;&#x5B9E;&#x65BD;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x8BA9;&#x7F16;&#x7A0B;&#x7684;&#x903B;&#x8F91;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E2A;&#x6BD4;&#x8F83;&#x62BD;&#x8C61;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x5F97;&#x6162;&#x6162;&#x53BB;&#x4F53;&#x4F1A;&#x3002;
&#x6BD4;&#x5982;&#x7528;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x6253;&#x4EBA;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5199;&#x6CD5;&#x4E0A;&#x53EA;&#x662F;&#x6CE8;&#x91CD;&#x6253;&#x4EBA;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x4E0D;&#x5728;&#x610F;&#x6253;&#x7684;&#x4EBA;&#x548C;&#x88AB;&#x6253;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x601D;&#x60F3;&#x5219;&#x76F8;&#x53CD;&#xFF0C;&#x6BD4;&#x5982;&#x5199;&#x7A0B;&#x5E8F;&#x5B9E;&#x73B0;&#x6253;&#x4EBA;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7528;Java&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Example</span></span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(Strng[] args)</span></span>{
        Person XiaoMing = <span class="hljs-keyword">new</span> Person();        <span class="hljs-comment">//&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6253;&#x7684;&#x4EBA;</span>
        Person XiaoHua = <span class="hljs-keyword">new</span> Person();        <span class="hljs-comment">//&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x88AB;&#x6253;&#x7684;&#x4EBA;</span>
        XiaoMing.beat(XiaoHua);                <span class="hljs-comment">//&#x5C0F;&#x660E;&#x6253;&#x5C0F;&#x82B1;</span>
    }
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Person</span></span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">beat</span><span class="hljs-params">(Person p)</span></span>{
        <span class="hljs-comment">//&#x8FD9;&#x91CC;&#x662F;&#x5B9E;&#x73B0;&#x6253;&#x4EBA;&#x7684;&#x65B9;&#x6CD5;</span>
    }
}
</code></pre>
<p>&#x4ECE;001&#xFF08;&#x673A;&#x5668;&#x7801;&#xFF09;&#x5230;OOP&#xFF08;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF09;&#x7684;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4EE3;&#x8868;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x4E5F;&#x4EE3;&#x8868;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x7528;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../2-登上爪哇岛/登上爪哇岛.html" class="navigation navigation-next " aria-label="Next page: 2-登上爪哇岛">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1-从001到OOP","level":"1.1.1","depth":2,"next":{"title":"2-登上爪哇岛","level":"1.1.2","depth":2,"path":"2-登上爪哇岛/登上爪哇岛.md","ref":"2-登上爪哇岛/登上爪哇岛.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[{"title":"1-从001到OOP","level":"1.1.1","depth":2,"path":"1-从001到OOP/从001到OOP.md","ref":"1-从001到OOP/从001到OOP.md","articles":[]},{"title":"2-登上爪哇岛","level":"1.1.2","depth":2,"path":"2-登上爪哇岛/登上爪哇岛.md","ref":"2-登上爪哇岛/登上爪哇岛.md","articles":[]},{"title":"3-神奇的补码","level":"1.1.3","depth":2,"path":"3-神奇的补码/神奇的补码.md","ref":"3-神奇的补码/神奇的补码.md","articles":[]},{"title":"4-浅谈基本数据类型","level":"1.1.4","depth":2,"path":"4-浅谈基本数据类型/浅谈基本数据类型.md","ref":"4-浅谈基本数据类型/浅谈基本数据类型.md","articles":[]},{"title":"5-标识符和运算符","level":"1.1.5","depth":2,"path":"5-标识符和运算符/标识符和运算符.md","ref":"5-标识符和运算符/标识符和运算符.md","articles":[]},{"title":"6-流程控制语句","level":"1.1.6","depth":2,"path":"6-流程控制语句/流程控制语句.md","ref":"6-流程控制语句/流程控制语句.md","articles":[]},{"title":"7-深入循环结构","level":"1.1.7","depth":2,"path":"7-深入循环结构/深入循环结构.md","ref":"7-深入循环结构/深入循环结构.md","articles":[]},{"title":"8-数组与排序","level":"1.1.8","depth":2,"path":"8-数组与排序/数组与排序.md","ref":"8-数组与排序/数组与排序.md","articles":[]},{"title":"9-功能体现之方法","level":"1.1.9","depth":2,"path":"9-功能体现之方法/功能体现之方法.md","ref":"9-功能体现之方法/功能体现之方法.md","articles":[]},{"title":"10-面向对象编程","level":"1.1.10","depth":2,"path":"10-面向对象编程/面向对象编程.md","ref":"10-面向对象编程/面向对象编程.md","articles":[]},{"title":"11-内部类","level":"1.1.11","depth":2,"path":"11-内部类/内部类.md","ref":"11-内部类/内部类.md","articles":[]},{"title":"12-处理异常","level":"1.1.12","depth":2,"path":"12-处理异常/处理异常.md","ref":"12-处理异常/处理异常.md","articles":[]},{"title":"13-常用类之Object","level":"1.1.13","depth":2,"path":"13-常用类之Object/常用类之Object.md","ref":"13-常用类之Object/常用类之Object.md","articles":[]},{"title":"14-常用类之Arrays","level":"1.1.14","depth":2,"path":"14-常用类之Arrays/常用类之Arrays.md","ref":"14-常用类之Arrays/常用类之Arrays.md","articles":[]},{"title":"15-常用类之String","level":"1.1.15","depth":2,"path":"15-常用类之String/常用类之String.md","ref":"15-常用类之String/常用类之String.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"1-从001到OOP/从001到OOP.md","mtime":"2017-07-18T11:50:58.059Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-07-18T11:52:02.529Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

